[
  {
    "id": 1,
    "event_title": "Music and dance performances at Kwara",
    "university": "Kwara State University",
    "category": "Cultural",
    "date": "2025-10-26",
    "time": "9:00 AM",
    "description": [
      "Music and dance performances at Kwara is an exciting event under the category of Cultural Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to music and dance performances, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Music and dance performances at Kwara promises to deliver value and excitement to all attendees."
    ],
    "location": "Open Grounds, Kwara",
    "image_url": "https://picsum.photos/seed/event1/400/250"
  },
  {
    "id": 2,
    "event_title": "Recognition events for student leaders and volunteers at Kwara",
    "university": "Kwara State University",
    "category": "Club & Organization",
    "date": "2026-01-31",
    "time": "11:00 AM",
    "description": [
      "Recognition events for student leaders and volunteers at Kwara is an exciting event under the category of Award Shows and Recognition Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to recognition events for student leaders and volunteers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Recognition events for student leaders and volunteers at Kwara promises to deliver value and excitement to all attendees."
    ],
    "location": "Lecture Theatre, Kwara",
    "image_url": "https://picsum.photos/seed/event2/400/250"
  },
  {
    "id": 3,
    "event_title": "Food festivals and fairs at Lagos",
    "university": "Lagos State University",
    "category": "Food-Related ",
    "date": "2026-07-04",
    "time": "13:00 AM",
    "description": [
      "Food festivals and fairs at Lagos is an exciting event under the category of Food-Related Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food festivals and fairs at Lagos promises to deliver value and excitement to all attendees."
    ],
    "location": "Open Grounds, Lagos",
    "image_url": "https://picsum.photos/seed/event3/400/250"
  },
  {
    "id": 4,
    "event_title": "GDSC UNILORIN Hackathon",
    "university": "University of Ilorin",
    "category": "Tech",
    "date": "2026-03-21",
    "time": "13:00 AM",
    "description": [
      "The Google Developer Student Clubs (GDSC) UNILORIN Hackathon is an electrifying tech competition where students from the University of Ilorin and beyond come together to brainstorm, build, and present innovative software or hardware solutions within a limited timeframe. Typically spanning 24-48 hours, this high-energy event challenges participants to tackle real-world problems—such as healthcare, education, agriculture, or finance—using cutting-edge technologies like AI, blockchain, cloud computing, or mobile development.",
      "Open to coders, designers, and entrepreneurs, the hackathon fosters collaboration, creativity, and technical skill development. Participants form teams, receive mentorship from industry experts, and pitch their prototypes to a panel of judges for prizes, networking opportunities, and potential incubation. Workshops and tech talks often accompany the event, offering insights into Google’s tools (e.g., Firebase, Flutter) and emerging trends.",
      "Winners may secure funding, internships, or a chance to compete in national/international hackathons. The GDSC UNILORIN Hackathon isn’t just about winning—it’s a launchpad for student-led innovation, community building, and career growth in tech. Past editions have seen projects ranging from AI-powered chatbots for local farmers to waste management apps, reflecting UNILORIN’s commitment to sustainable development through technology."
    ],
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event4/400/250"
  },
  {
    "id": 5,
    "event_title": "Intramural sports tournaments at Lagos",
    "university": "Lagos State University",
    "category": "Sports",
    "date": "2025-10-02",
    "time": "9:00 AM",
    "description": [
      "Intramural sports tournaments at Lagos is an exciting event under the category of Sports Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to intramural sports tournaments, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Intramural sports tournaments at Lagos promises to deliver value and excitement to all attendees."
    ],
    "location": "Lecture Theatre, Lagos",
    "image_url": "https://picsum.photos/seed/event5/400/250"
  },
  {
    "id": 6,
    "event_title": "Welcome parties for new students at University",
    "university": "University of Ibadan",
    "category": "Social",
    "date": "2025-11-02",
    "time": "15:00 AM",
    "description": [
      "Welcome parties for new students at University is an exciting event under the category of Social Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to welcome parties for new students, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Welcome parties for new students at University promises to deliver value and excitement to all attendees."
    ],
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event6/400/250"
  },
  {
    "id": 7,
    "event_title": "Workshops and training sessions at University",
    "university": "University of Ibadan",
    "category": "Academic",
    "date": "2025-10-31",
    "time": "9:00 AM",
    "description": [
      "Workshops and training sessions at University is an exciting event under the category of Academic Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to workshops and training sessions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Workshops and training sessions at University promises to deliver value and excitement to all attendees."
    ],
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event7/400/250"
  },
  {
    "id": 8,
    "event_title": "Intramural sports tournaments at University",
    "university": "University of Ilorin",
    "category": "Sports",
    "date": "2025-11-13",
    "time": "9:00 AM",
    "description": [
      "Intramural sports tournaments at University is an exciting event under the category of Sports Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to intramural sports tournaments, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Intramural sports tournaments at University promises to deliver value and excitement to all attendees."
    ],
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event8/400/250"
  },
  {
    "id": 9,
    "event_title": "Campus dining events and promotions at University",
    "university": "University of Lagos",
    "category": "Food-Related ",
    "date": "2026-06-18",
    "time": "16:00 AM",
    "description": [
      "Campus dining events and promotions at University is an exciting event under the category of Food-Related Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to campus dining events and promotions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Campus dining events and promotions at University promises to deliver value and excitement to all attendees."
    ],
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event9/400/250"
  },
  {
    "id": 10,
    "event_title": "Cultural cuisine nights at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2025-12-09",
    "time": "11:00 AM",
    "description": [
      "Cultural cuisine nights at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural cuisine nights, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural cuisine nights at University promises to deliver value and excitement to all attendees."
    ],
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event10/400/250"
  },
  {
    "id": 11,
    "event_title": "Cultural cuisine nights at University",
    "university": "University of Ibadan",
    "category": "Food-Related ",
    "date": "2026-06-22",
    "time": "12:00 AM",
    "description": "Cultural cuisine nights at University is an exciting event under the category of Food-Related Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural cuisine nights, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural cuisine nights at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event11/400/250"
  },
  {
    "id": 12,
    "event_title": "Inter-university sports competitions at University",
    "university": "University of Lagos",
    "category": "Sports",
    "date": "2025-12-07",
    "time": "9:00 AM",
    "description": "Inter-university sports competitions at University is an exciting event under the category of Sports Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event12/400/250"
  },
  {
    "id": 13,
    "event_title": "Workshops and training sessions at University",
    "university": "University of Ibadan",
    "category": "Academic",
    "date": "2025-10-27",
    "time": "17:00 AM",
    "description": "Workshops and training sessions at University is an exciting event under the category of Academic Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to workshops and training sessions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Workshops and training sessions at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event13/400/250"
  },
  {
    "id": 14,
    "event_title": "Drama and theater productions at Lagos",
    "university": "Lagos State University",
    "category": "Cultural",
    "date": "2025-08-24",
    "time": "16:00 AM",
    "description": "Drama and theater productions at Lagos is an exciting event under the category of Cultural Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to drama and theater productions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Drama and theater productions at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Lagos",
    "image_url": "https://picsum.photos/seed/event14/400/250"
  },
  {
    "id": 15,
    "event_title": "Hackathons and coding competitions at University",
    "university": "University of Ilorin",
    "category": "Other Events",
    "date": "2026-06-21",
    "time": "14:00 AM",
    "description": "Hackathons and coding competitions at University is an exciting event under the category of Other Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to hackathons and coding competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Hackathons and coding competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event15/400/250"
  },
  {
    "id": 16,
    "event_title": "Career fairs and job expos at University",
    "university": "University of Ibadan",
    "category": "Other Events",
    "date": "2025-08-11",
    "time": "12:00 AM",
    "description": "Career fairs and job expos at University is an exciting event under the category of Other Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to career fairs and job expos, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Career fairs and job expos at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event16/400/250"
  },
  {
    "id": 17,
    "event_title": "Drama and theater productions at Lagos",
    "university": "Lagos State University",
    "category": "Cultural",
    "date": "2025-08-16",
    "time": "11:00 AM",
    "description": "Drama and theater productions at Lagos is an exciting event under the category of Cultural Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to drama and theater productions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Drama and theater productions at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, Lagos",
    "image_url": "https://picsum.photos/seed/event17/400/250"
  },
  {
    "id": 18,
    "event_title": "Award ceremonies for academic achievement at University",
    "university": "University of Lagos",
    "category": "Club & Organization",
    "date": "2025-12-17",
    "time": "12:00 AM",
    "description": "Award ceremonies for academic achievement at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to award ceremonies for academic achievement, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Award ceremonies for academic achievement at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event18/400/250"
  },
  {
    "id": 19,
    "event_title": "Music and dance performances at University",
    "university": "University of Ilorin",
    "category": "Cultural",
    "date": "2026-06-16",
    "time": "13:00 AM",
    "description": "Music and dance performances at University is an exciting event under the category of Cultural Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to music and dance performances, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Music and dance performances at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event19/400/250"
  },
  {
    "id": 20,
    "event_title": "Music and dance performances at University",
    "university": "University of Lagos",
    "category": "Cultural",
    "date": "2025-11-22",
    "time": "9:00 AM",
    "description": "Music and dance performances at University is an exciting event under the category of Cultural Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to music and dance performances, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Music and dance performances at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event20/400/250"
  },
  {
    "id": 21,
    "event_title": "Fitness classes and workshops at Lagos",
    "university": "Lagos State University",
    "category": "Sports",
    "date": "2025-08-06",
    "time": "17:00 AM",
    "description": "Fitness classes and workshops at Lagos is an exciting event under the category of Sports Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to fitness classes and workshops, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Fitness classes and workshops at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Lagos",
    "image_url": "https://picsum.photos/seed/event21/400/250"
  },
  {
    "id": 22,
    "event_title": "Food-themed competitions (e.g., cooking, baking) at Kwara",
    "university": "Kwara State University",
    "category": "Food-Related ",
    "date": "2026-06-02",
    "time": "10:00 AM",
    "description": "Food-themed competitions (e.g., cooking, baking) at Kwara is an exciting event under the category of Food-Related Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food-themed competitions (e.g., cooking, baking), meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food-themed competitions (e.g., cooking, baking) at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, Kwara",
    "image_url": "https://picsum.photos/seed/event22/400/250"
  },
  {
    "id": 23,
    "event_title": "Conferences and seminars at Lagos",
    "university": "Lagos State University",
    "category": "Academic",
    "date": "2026-03-21",
    "time": "17:00 AM",
    "description": "Conferences and seminars at Lagos is an exciting event under the category of Academic Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to conferences and seminars, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Conferences and seminars at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, Lagos",
    "image_url": "https://picsum.photos/seed/event23/400/250"
  },
  {
    "id": 24,
    "event_title": "Inter-university sports competitions at University",
    "university": "University of Lagos",
    "category": "Sports",
    "date": "2026-03-08",
    "time": "12:00 AM",
    "description": "Inter-university sports competitions at University is an exciting event under the category of Sports Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event24/400/250"
  },
  {
    "id": 25,
    "event_title": "Intramural sports tournaments at University",
    "university": "University of Lagos",
    "category": "Sports",
    "date": "2025-12-25",
    "time": "15:00 AM",
    "description": "Intramural sports tournaments at University is an exciting event under the category of Sports Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to intramural sports tournaments, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Intramural sports tournaments at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event25/400/250"
  },
  {
    "id": 26,
    "event_title": "Cultural festivals and fairs at Lagos",
    "university": "Lagos State University",
    "category": "Cultural",
    "date": "2026-02-04",
    "time": "16:00 AM",
    "description": "Cultural festivals and fairs at Lagos is an exciting event under the category of Cultural Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Lagos",
    "image_url": "https://picsum.photos/seed/event26/400/250"
  },
  {
    "id": 27,
    "event_title": "Recognition events for student leaders and volunteers at University",
    "university": "University of Ibadan",
    "category": "Club & Organization",
    "date": "2026-07-21",
    "time": "14:00 AM",
    "description": "Recognition events for student leaders and volunteers at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to recognition events for student leaders and volunteers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Recognition events for student leaders and volunteers at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event27/400/250"
  },
  {
    "id": 28,
    "event_title": "Cultural festivals and fairs at University",
    "university": "University of Ibadan",
    "category": "Cultural",
    "date": "2026-02-18",
    "time": "13:00 AM",
    "description": "Cultural festivals and fairs at University is an exciting event under the category of Cultural Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event28/400/250"
  },
  {
    "id": 29,
    "event_title": "Guest lectures and TED-style talks at University",
    "university": "University of Lagos",
    "category": "Academic",
    "date": "2025-12-31",
    "time": "17:00 AM",
    "description": "Guest lectures and TED-style talks at University is an exciting event under the category of Academic Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event29/400/250"
  },
  {
    "id": 30,
    "event_title": "Cultural festivals and fairs at University",
    "university": "University of Ibadan",
    "category": "Cultural",
    "date": "2025-07-28",
    "time": "16:00 AM",
    "description": "Cultural festivals and fairs at University is an exciting event under the category of Cultural Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event30/400/250"
  },
  {
    "id": 31,
    "event_title": "Music and dance performances at University",
    "university": "University of Ibadan",
    "category": "Cultural",
    "date": "2025-11-28",
    "time": "15:00 AM",
    "description": "Music and dance performances at University is an exciting event under the category of Cultural Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to music and dance performances, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Music and dance performances at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event31/400/250"
  },
  {
    "id": 32,
    "event_title": "Research presentations and exhibitions at University",
    "university": "University of Lagos",
    "category": "Academic",
    "date": "2026-02-18",
    "time": "17:00 AM",
    "description": "Research presentations and exhibitions at University is an exciting event under the category of Academic Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to research presentations and exhibitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Research presentations and exhibitions at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event32/400/250"
  },
  {
    "id": 33,
    "event_title": "Hackathons and coding competitions at University",
    "university": "University of Ilorin",
    "category": "Other Events",
    "date": "2025-10-15",
    "time": "15:00 AM",
    "description": "Hackathons and coding competitions at University is an exciting event under the category of Other Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to hackathons and coding competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Hackathons and coding competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event33/400/250"
  },
  {
    "id": 34,
    "event_title": "Campus dining events and promotions at University",
    "university": "University of Ibadan",
    "category": "Food-Related ",
    "date": "2026-01-02",
    "time": "10:00 AM",
    "description": "Campus dining events and promotions at University is an exciting event under the category of Food-Related Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to campus dining events and promotions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Campus dining events and promotions at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event34/400/250"
  },
  {
    "id": 35,
    "event_title": "Entrepreneurship and startup events at University",
    "university": "University of Ilorin",
    "category": "Other Events",
    "date": "2025-09-18",
    "time": "17:00 AM",
    "description": "Entrepreneurship and startup events at University is an exciting event under the category of Other Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to entrepreneurship and startup events, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Entrepreneurship and startup events at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event35/400/250"
  },
  {
    "id": 36,
    "event_title": "Sports days and fun runs at Lagos",
    "university": "Lagos State University",
    "category": "Sports",
    "date": "2025-10-20",
    "time": "15:00 AM",
    "description": "Sports days and fun runs at Lagos is an exciting event under the category of Sports Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to sports days and fun runs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Sports days and fun runs at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Lagos",
    "image_url": "https://picsum.photos/seed/event36/400/250"
  },
  {
    "id": 37,
    "event_title": "Food festivals and fairs at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2025-09-14",
    "time": "17:00 AM",
    "description": "Food festivals and fairs at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event37/400/250"
  },
  {
    "id": 38,
    "event_title": "Sports days and fun runs at Lagos",
    "university": "Lagos State University",
    "category": "Sports",
    "date": "2025-11-05",
    "time": "12:00 AM",
    "description": "Sports days and fun runs at Lagos is an exciting event under the category of Sports Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to sports days and fun runs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Sports days and fun runs at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, Lagos",
    "image_url": "https://picsum.photos/seed/event38/400/250"
  },
  {
    "id": 39,
    "event_title": "Cultural festivals and fairs at University",
    "university": "University of Ilorin",
    "category": "Cultural",
    "date": "2025-07-26",
    "time": "10:00 AM",
    "description": "Cultural festivals and fairs at University is an exciting event under the category of Cultural Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event39/400/250"
  },
  {
    "id": 40,
    "event_title": "Workshops and training sessions at Kwara",
    "university": "Kwara State University",
    "category": "Academic",
    "date": "2025-12-28",
    "time": "15:00 AM",
    "description": "Workshops and training sessions at Kwara is an exciting event under the category of Academic Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to workshops and training sessions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Workshops and training sessions at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, Kwara",
    "image_url": "https://picsum.photos/seed/event40/400/250"
  },
  {
    "id": 41,
    "event_title": "Food festivals and fairs at Lagos",
    "university": "Lagos State University",
    "category": "Food-Related ",
    "date": "2025-11-07",
    "time": "12:00 AM",
    "description": "Food festivals and fairs at Lagos is an exciting event under the category of Food-Related Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food festivals and fairs at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, Lagos",
    "image_url": "https://picsum.photos/seed/event41/400/250"
  },
  {
    "id": 42,
    "event_title": "Conferences and seminars at Kwara",
    "university": "Kwara State University",
    "category": "Academic",
    "date": "2025-08-28",
    "time": "15:00 AM",
    "description": "Conferences and seminars at Kwara is an exciting event under the category of Academic Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to conferences and seminars, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Conferences and seminars at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, Kwara",
    "image_url": "https://picsum.photos/seed/event42/400/250"
  },
  {
    "id": 43,
    "event_title": "Honorary lectures and keynote speeches at Lagos",
    "university": "Lagos State University",
    "category": "Club & Organization",
    "date": "2025-12-29",
    "time": "12:00 AM",
    "description": "Honorary lectures and keynote speeches at Lagos is an exciting event under the category of Award Shows and Recognition Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to honorary lectures and keynote speeches, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Honorary lectures and keynote speeches at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, Lagos",
    "image_url": "https://picsum.photos/seed/event43/400/250"
  },
  {
    "id": 44,
    "event_title": "Charity events and fundraisers at University",
    "university": "University of Ibadan",
    "category": "Social",
    "date": "2025-10-14",
    "time": "12:00 AM",
    "description": "Charity events and fundraisers at University is an exciting event under the category of Social Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to charity events and fundraisers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Charity events and fundraisers at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event44/400/250"
  },
  {
    "id": 45,
    "event_title": "Mental health awareness and wellness events at University",
    "university": "University of Lagos",
    "category": "Other Events",
    "date": "2026-04-28",
    "time": "12:00 AM",
    "description": "Mental health awareness and wellness events at University is an exciting event under the category of Other Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to mental health awareness and wellness events, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Mental health awareness and wellness events at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event45/400/250"
  },
  {
    "id": 46,
    "event_title": "Guest lectures and TED-style talks at University",
    "university": "University of Ilorin",
    "category": "Academic",
    "date": "2025-11-02",
    "time": "12:00 AM",
    "description": "Guest lectures and TED-style talks at University is an exciting event under the category of Academic Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event46/400/250"
  },
  {
    "id": 47,
    "event_title": "Cultural festivals and fairs at University",
    "university": "University of Lagos",
    "category": "Cultural",
    "date": "2025-09-15",
    "time": "10:00 AM",
    "description": "Cultural festivals and fairs at University is an exciting event under the category of Cultural Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event47/400/250"
  },
  {
    "id": 48,
    "event_title": "Award ceremonies for academic achievement at University",
    "university": "University of Lagos",
    "category": "Club & Organization",
    "date": "2026-04-09",
    "time": "12:00 AM",
    "description": "Award ceremonies for academic achievement at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to award ceremonies for academic achievement, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Award ceremonies for academic achievement at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event48/400/250"
  },
  {
    "id": 49,
    "event_title": "Cultural festivals and fairs at Lagos",
    "university": "Lagos State University",
    "category": "Cultural",
    "date": "2026-01-16",
    "time": "14:00 AM",
    "description": "Cultural festivals and fairs at Lagos is an exciting event under the category of Cultural Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, Lagos",
    "image_url": "https://picsum.photos/seed/event49/400/250"
  },
  {
    "id": 50,
    "event_title": "Conferences and seminars at University",
    "university": "University of Lagos",
    "category": "Academic",
    "date": "2026-04-15",
    "time": "16:00 AM",
    "description": "Conferences and seminars at University is an exciting event under the category of Academic Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to conferences and seminars, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Conferences and seminars at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event50/400/250"
  },
  {
    "id": 51,
    "event_title": "Award ceremonies for academic achievement at University",
    "university": "University of Ilorin",
    "category": "Club & Organization",
    "date": "2026-04-25",
    "time": "14:00 AM",
    "description": "Award ceremonies for academic achievement at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to award ceremonies for academic achievement, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Award ceremonies for academic achievement at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event51/400/250"
  },
  {
    "id": 52,
    "event_title": "Hackathons and coding competitions at Lagos",
    "university": "Lagos State University",
    "category": "Other Events",
    "date": "2026-07-12",
    "time": "15:00 AM",
    "description": "Hackathons and coding competitions at Lagos is an exciting event under the category of Other Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to hackathons and coding competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Hackathons and coding competitions at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, Lagos",
    "image_url": "https://picsum.photos/seed/event52/400/250"
  },
  {
    "id": 53,
    "event_title": "Alumni events and reunions at University",
    "university": "University of Ilorin",
    "category": "Social",
    "date": "2025-08-29",
    "time": "9:00 AM",
    "description": "Alumni events and reunions at University is an exciting event under the category of Social Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to alumni events and reunions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Alumni events and reunions at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event53/400/250"
  },
  {
    "id": 54,
    "event_title": "Guest lectures and TED-style talks at University",
    "university": "University of Ilorin",
    "category": "Academic",
    "date": "2025-12-14",
    "time": "15:00 AM",
    "description": "Guest lectures and TED-style talks at University is an exciting event under the category of Academic Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event54/400/250"
  },
  {
    "id": 55,
    "event_title": "Food-themed competitions (e.g., cooking, baking) at University",
    "university": "University of Lagos",
    "category": "Food-Related ",
    "date": "2025-09-20",
    "time": "15:00 AM",
    "description": "Food-themed competitions (e.g., cooking, baking) at University is an exciting event under the category of Food-Related Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food-themed competitions (e.g., cooking, baking), meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food-themed competitions (e.g., cooking, baking) at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event55/400/250"
  },
  {
    "id": 56,
    "event_title": "Honorary lectures and keynote speeches at Kwara",
    "university": "Kwara State University",
    "category": "Club & Organization",
    "date": "2025-09-14",
    "time": "16:00 AM",
    "description": "Honorary lectures and keynote speeches at Kwara is an exciting event under the category of Award Shows and Recognition Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to honorary lectures and keynote speeches, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Honorary lectures and keynote speeches at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, Kwara",
    "image_url": "https://picsum.photos/seed/event56/400/250"
  },
  {
    "id": 57,
    "event_title": "Guest lectures and TED-style talks at University",
    "university": "University of Ilorin",
    "category": "Academic",
    "date": "2026-03-25",
    "time": "13:00 AM",
    "description": "Guest lectures and TED-style talks at University is an exciting event under the category of Academic Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event57/400/250"
  },
  {
    "id": 58,
    "event_title": "Award ceremonies for academic achievement at University",
    "university": "University of Ilorin",
    "category": "Club & Organization",
    "date": "2026-04-15",
    "time": "14:00 AM",
    "description": "Award ceremonies for academic achievement at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to award ceremonies for academic achievement, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Award ceremonies for academic achievement at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event58/400/250"
  },
  {
    "id": 59,
    "event_title": "Art exhibitions and showcases at University",
    "university": "University of Lagos",
    "category": "Cultural",
    "date": "2026-03-10",
    "time": "12:00 AM",
    "description": "Art exhibitions and showcases at University is an exciting event under the category of Cultural Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to art exhibitions and showcases, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Art exhibitions and showcases at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event59/400/250"
  },
  {
    "id": 60,
    "event_title": "Honorary lectures and keynote speeches at University",
    "university": "University of Ilorin",
    "category": "Club & Organization",
    "date": "2026-02-04",
    "time": "14:00 AM",
    "description": "Honorary lectures and keynote speeches at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to honorary lectures and keynote speeches, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Honorary lectures and keynote speeches at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event60/400/250"
  },
  {
    "id": 61,
    "event_title": "Guest lectures and TED-style talks at University",
    "university": "University of Lagos",
    "category": "Academic",
    "date": "2025-12-05",
    "time": "13:00 AM",
    "description": "Guest lectures and TED-style talks at University is an exciting event under the category of Academic Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event61/400/250"
  },
  {
    "id": 62,
    "event_title": "Alumni events and reunions at Kwara",
    "university": "Kwara State University",
    "category": "Social",
    "date": "2026-01-31",
    "time": "14:00 AM",
    "description": "Alumni events and reunions at Kwara is an exciting event under the category of Social Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to alumni events and reunions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Alumni events and reunions at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Kwara",
    "image_url": "https://picsum.photos/seed/event62/400/250"
  },
  {
    "id": 63,
    "event_title": "Drama and theater productions at Kwara",
    "university": "Kwara State University",
    "category": "Cultural",
    "date": "2025-11-17",
    "time": "12:00 AM",
    "description": "Drama and theater productions at Kwara is an exciting event under the category of Cultural Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to drama and theater productions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Drama and theater productions at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, Kwara",
    "image_url": "https://picsum.photos/seed/event63/400/250"
  },
  {
    "id": 64,
    "event_title": "Fitness classes and workshops at University",
    "university": "University of Ilorin",
    "category": "Sports",
    "date": "2026-07-10",
    "time": "12:00 AM",
    "description": "Fitness classes and workshops at University is an exciting event under the category of Sports Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to fitness classes and workshops, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Fitness classes and workshops at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event64/400/250"
  },
  {
    "id": 65,
    "event_title": "Alumni events and reunions at Lagos",
    "university": "Lagos State University",
    "category": "Social",
    "date": "2025-08-09",
    "time": "15:00 AM",
    "description": "Alumni events and reunions at Lagos is an exciting event under the category of Social Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to alumni events and reunions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Alumni events and reunions at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, Lagos",
    "image_url": "https://picsum.photos/seed/event65/400/250"
  },
  {
    "id": 66,
    "event_title": "Award ceremonies for academic achievement at Kwara",
    "university": "Kwara State University",
    "category": "Club & Organization",
    "date": "2025-07-28",
    "time": "14:00 AM",
    "description": "Award ceremonies for academic achievement at Kwara is an exciting event under the category of Award Shows and Recognition Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to award ceremonies for academic achievement, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Award ceremonies for academic achievement at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, Kwara",
    "image_url": "https://picsum.photos/seed/event66/400/250"
  },
  {
    "id": 67,
    "event_title": "Charity events and fundraisers at University",
    "university": "University of Lagos",
    "category": "Social",
    "date": "2026-04-05",
    "time": "9:00 AM",
    "description": "Charity events and fundraisers at University is an exciting event under the category of Social Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to charity events and fundraisers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Charity events and fundraisers at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event67/400/250"
  },
  {
    "id": 68,
    "event_title": "Drama and theater productions at University",
    "university": "University of Lagos",
    "category": "Cultural",
    "date": "2026-04-01",
    "time": "17:00 AM",
    "description": "Drama and theater productions at University is an exciting event under the category of Cultural Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to drama and theater productions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Drama and theater productions at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event68/400/250"
  },
  {
    "id": 69,
    "event_title": "Food festivals and fairs at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2025-11-22",
    "time": "15:00 AM",
    "description": "Food festivals and fairs at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event69/400/250"
  },
  {
    "id": 70,
    "event_title": "Recognition events for student leaders and volunteers at University",
    "university": "University of Lagos",
    "category": "Club & Organization",
    "date": "2026-07-15",
    "time": "15:00 AM",
    "description": "Recognition events for student leaders and volunteers at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to recognition events for student leaders and volunteers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Recognition events for student leaders and volunteers at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event70/400/250"
  },
  {
    "id": 71,
    "event_title": "Cultural cuisine nights at University",
    "university": "University of Lagos",
    "category": "Food-Related ",
    "date": "2025-10-16",
    "time": "12:00 AM",
    "description": "Cultural cuisine nights at University is an exciting event under the category of Food-Related Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural cuisine nights, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural cuisine nights at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event71/400/250"
  },
  {
    "id": 72,
    "event_title": "Honorary lectures and keynote speeches at University",
    "university": "University of Ibadan",
    "category": "Club & Organization",
    "date": "2026-07-13",
    "time": "10:00 AM",
    "description": "Honorary lectures and keynote speeches at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to honorary lectures and keynote speeches, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Honorary lectures and keynote speeches at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event72/400/250"
  },
  {
    "id": 73,
    "event_title": "Art exhibitions and showcases at Kwara",
    "university": "Kwara State University",
    "category": "Cultural",
    "date": "2026-05-06",
    "time": "9:00 AM",
    "description": "Art exhibitions and showcases at Kwara is an exciting event under the category of Cultural Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to art exhibitions and showcases, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Art exhibitions and showcases at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, Kwara",
    "image_url": "https://picsum.photos/seed/event73/400/250"
  },
  {
    "id": 74,
    "event_title": "Food-themed competitions (e.g., cooking, baking) at University",
    "university": "University of Ibadan",
    "category": "Food-Related ",
    "date": "2025-11-24",
    "time": "10:00 AM",
    "description": "Food-themed competitions (e.g., cooking, baking) at University is an exciting event under the category of Food-Related Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food-themed competitions (e.g., cooking, baking), meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food-themed competitions (e.g., cooking, baking) at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event74/400/250"
  },
  {
    "id": 75,
    "event_title": "Inter-university sports competitions at University",
    "university": "University of Ilorin",
    "category": "Sports",
    "date": "2026-02-02",
    "time": "13:00 AM",
    "description": "Inter-university sports competitions at University is an exciting event under the category of Sports Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event75/400/250"
  },
  {
    "id": 76,
    "event_title": "Recognition events for student leaders and volunteers at University",
    "university": "University of Lagos",
    "category": "Club & Organization",
    "date": "2026-01-07",
    "time": "16:00 AM",
    "description": "Recognition events for student leaders and volunteers at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to recognition events for student leaders and volunteers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Recognition events for student leaders and volunteers at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event76/400/250"
  },
  {
    "id": 77,
    "event_title": "Campus dining events and promotions at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2026-05-23",
    "time": "13:00 AM",
    "description": "Campus dining events and promotions at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to campus dining events and promotions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Campus dining events and promotions at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event77/400/250"
  },
  {
    "id": 78,
    "event_title": "Fitness classes and workshops at University",
    "university": "University of Ilorin",
    "category": "Sports",
    "date": "2026-03-05",
    "time": "10:00 AM",
    "description": "Fitness classes and workshops at University is an exciting event under the category of Sports Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to fitness classes and workshops, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Fitness classes and workshops at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event78/400/250"
  },
  {
    "id": 79,
    "event_title": "Campus dining events and promotions at Kwara",
    "university": "Kwara State University",
    "category": "Food-Related ",
    "date": "2026-03-28",
    "time": "17:00 AM",
    "description": "Campus dining events and promotions at Kwara is an exciting event under the category of Food-Related Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to campus dining events and promotions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Campus dining events and promotions at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, Kwara",
    "image_url": "https://picsum.photos/seed/event79/400/250"
  },
  {
    "id": 80,
    "event_title": "Guest lectures and TED-style talks at Kwara",
    "university": "Kwara State University",
    "category": "Academic",
    "date": "2026-02-19",
    "time": "13:00 AM",
    "description": "Guest lectures and TED-style talks at Kwara is an exciting event under the category of Academic Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, Kwara",
    "image_url": "https://picsum.photos/seed/event80/400/250"
  },
  {
    "id": 81,
    "event_title": "Hackathons and coding competitions at University",
    "university": "University of Lagos",
    "category": "Other Events",
    "date": "2026-02-09",
    "time": "9:00 AM",
    "description": "Hackathons and coding competitions at University is an exciting event under the category of Other Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to hackathons and coding competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Hackathons and coding competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event81/400/250"
  },
  {
    "id": 82,
    "event_title": "Recognition events for student leaders and volunteers at Lagos",
    "university": "Lagos State University",
    "category": "Club & Organization",
    "date": "2026-05-08",
    "time": "17:00 AM",
    "description": "Recognition events for student leaders and volunteers at Lagos is an exciting event under the category of Award Shows and Recognition Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to recognition events for student leaders and volunteers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Recognition events for student leaders and volunteers at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, Lagos",
    "image_url": "https://picsum.photos/seed/event82/400/250"
  },
  {
    "id": 83,
    "event_title": "Cultural cuisine nights at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2025-08-29",
    "time": "9:00 AM",
    "description": "Cultural cuisine nights at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural cuisine nights, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural cuisine nights at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event83/400/250"
  },
  {
    "id": 84,
    "event_title": "Inter-university sports competitions at University",
    "university": "University of Ilorin",
    "category": "Sports",
    "date": "2026-05-17",
    "time": "9:00 AM",
    "description": "Inter-university sports competitions at University is an exciting event under the category of Sports Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event84/400/250"
  },
  {
    "id": 85,
    "event_title": "Food festivals and fairs at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2026-05-23",
    "time": "9:00 AM",
    "description": "Food festivals and fairs at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event85/400/250"
  },
  {
    "id": 86,
    "event_title": "Recognition events for student leaders and volunteers at University",
    "university": "University of Lagos",
    "category": "Club & Organization",
    "date": "2025-10-02",
    "time": "9:00 AM",
    "description": "Recognition events for student leaders and volunteers at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to recognition events for student leaders and volunteers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Recognition events for student leaders and volunteers at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event86/400/250"
  },
  {
    "id": 87,
    "event_title": "Food festivals and fairs at Kwara",
    "university": "Kwara State University",
    "category": "Food-Related ",
    "date": "2025-11-20",
    "time": "11:00 AM",
    "description": "Food festivals and fairs at Kwara is an exciting event under the category of Food-Related Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food festivals and fairs at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, Kwara",
    "image_url": "https://picsum.photos/seed/event87/400/250"
  },
  {
    "id": 88,
    "event_title": "Career fairs and job expos at Kwara",
    "university": "Kwara State University",
    "category": "Other Events",
    "date": "2026-02-28",
    "time": "11:00 AM",
    "description": "Career fairs and job expos at Kwara is an exciting event under the category of Other Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to career fairs and job expos, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Career fairs and job expos at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Kwara",
    "image_url": "https://picsum.photos/seed/event88/400/250"
  },
  {
    "id": 89,
    "event_title": "Music and dance performances at University",
    "university": "University of Ilorin",
    "category": "Cultural",
    "date": "2025-08-23",
    "time": "13:00 AM",
    "description": "Music and dance performances at University is an exciting event under the category of Cultural Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to music and dance performances, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Music and dance performances at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event89/400/250"
  },
  {
    "id": 90,
    "event_title": "Inter-university sports competitions at University",
    "university": "University of Ilorin",
    "category": "Sports",
    "date": "2025-09-23",
    "time": "12:00 AM",
    "description": "Inter-university sports competitions at University is an exciting event under the category of Sports Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event90/400/250"
  },
  {
    "id": 91,
    "event_title": "Campus dining events and promotions at Kwara",
    "university": "Kwara State University",
    "category": "Food-Related ",
    "date": "2026-02-28",
    "time": "13:00 AM",
    "description": "Campus dining events and promotions at Kwara is an exciting event under the category of Food-Related Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to campus dining events and promotions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Campus dining events and promotions at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, Kwara",
    "image_url": "https://picsum.photos/seed/event91/400/250"
  },
  {
    "id": 92,
    "event_title": "Career fairs and job expos at Kwara",
    "university": "Kwara State University",
    "category": "Other Events",
    "date": "2025-11-07",
    "time": "9:00 AM",
    "description": "Career fairs and job expos at Kwara is an exciting event under the category of Other Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to career fairs and job expos, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Career fairs and job expos at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, Kwara",
    "image_url": "https://picsum.photos/seed/event92/400/250"
  },
  {
    "id": 93,
    "event_title": "Hackathons and coding competitions at University",
    "university": "University of Ibadan",
    "category": "Other Events",
    "date": "2025-09-05",
    "time": "15:00 AM",
    "description": "Hackathons and coding competitions at University is an exciting event under the category of Other Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to hackathons and coding competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Hackathons and coding competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event93/400/250"
  },
  {
    "id": 94,
    "event_title": "Intramural sports tournaments at University",
    "university": "University of Lagos",
    "category": "Sports",
    "date": "2026-05-07",
    "time": "15:00 AM",
    "description": "Intramural sports tournaments at University is an exciting event under the category of Sports Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to intramural sports tournaments, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Intramural sports tournaments at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event94/400/250"
  },
  {
    "id": 95,
    "event_title": "Guest lectures and TED-style talks at Kwara",
    "university": "Kwara State University",
    "category": "Academic",
    "date": "2026-07-15",
    "time": "14:00 AM",
    "description": "Guest lectures and TED-style talks at Kwara is an exciting event under the category of Academic Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, Kwara",
    "image_url": "https://picsum.photos/seed/event95/400/250"
  },
  {
    "id": 96,
    "event_title": "Inter-university sports competitions at University",
    "university": "University of Ibadan",
    "category": "Sports",
    "date": "2025-12-28",
    "time": "9:00 AM",
    "description": "Inter-university sports competitions at University is an exciting event under the category of Sports Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event96/400/250"
  },
  {
    "id": 97,
    "event_title": "Cultural festivals and fairs at Lagos",
    "university": "Lagos State University",
    "category": "Cultural",
    "date": "2025-10-14",
    "time": "9:00 AM",
    "description": "Cultural festivals and fairs at Lagos is an exciting event under the category of Cultural Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, Lagos",
    "image_url": "https://picsum.photos/seed/event97/400/250"
  },
  {
    "id": 98,
    "event_title": "Intramural sports tournaments at Lagos",
    "university": "Lagos State University",
    "category": "Sports",
    "date": "2025-09-08",
    "time": "11:00 AM",
    "description": "Intramural sports tournaments at Lagos is an exciting event under the category of Sports Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to intramural sports tournaments, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Intramural sports tournaments at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, Lagos",
    "image_url": "https://picsum.photos/seed/event98/400/250"
  },
  {
    "id": 99,
    "event_title": "Cultural festivals and fairs at University",
    "university": "University of Ilorin",
    "category": "Cultural",
    "date": "2026-07-02",
    "time": "10:00 AM",
    "description": "Cultural festivals and fairs at University is an exciting event under the category of Cultural Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event99/400/250"
  },
  {
    "id": 100,
    "event_title": "Career fairs and job expos at University",
    "university": "University of Lagos",
    "category": "Other Events",
    "date": "2026-04-21",
    "time": "14:00 AM",
    "description": "Career fairs and job expos at University is an exciting event under the category of Other Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to career fairs and job expos, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Career fairs and job expos at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event100/400/250"
  },
  {
    "id": 101,
    "event_title": "Intramural sports tournaments at University",
    "university": "University of Ilorin",
    "category": "Sports",
    "date": "2025-10-16",
    "time": "9:00 AM",
    "description": "Intramural sports tournaments at University is an exciting event under the category of Sports Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to intramural sports tournaments, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Intramural sports tournaments at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event101/400/250"
  },
  {
    "id": 102,
    "event_title": "Charity events and fundraisers at Lagos",
    "university": "Lagos State University",
    "category": "Social",
    "date": "2026-04-16",
    "time": "14:00 AM",
    "description": "Charity events and fundraisers at Lagos is an exciting event under the category of Social Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to charity events and fundraisers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Charity events and fundraisers at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Lagos",
    "image_url": "https://picsum.photos/seed/event102/400/250"
  },
  {
    "id": 103,
    "event_title": "Guest lectures and TED-style talks at Kwara",
    "university": "Kwara State University",
    "category": "Academic",
    "date": "2026-01-15",
    "time": "15:00 AM",
    "description": "Guest lectures and TED-style talks at Kwara is an exciting event under the category of Academic Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, Kwara",
    "image_url": "https://picsum.photos/seed/event103/400/250"
  },
  {
    "id": 104,
    "event_title": "Fitness classes and workshops at Lagos",
    "university": "Lagos State University",
    "category": "Sports",
    "date": "2026-05-03",
    "time": "11:00 AM",
    "description": "Fitness classes and workshops at Lagos is an exciting event under the category of Sports Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to fitness classes and workshops, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Fitness classes and workshops at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, Lagos",
    "image_url": "https://picsum.photos/seed/event104/400/250"
  },
  {
    "id": 105,
    "event_title": "Award ceremonies for academic achievement at University",
    "university": "University of Lagos",
    "category": "Club & Organization",
    "date": "2026-05-26",
    "time": "17:00 AM",
    "description": "Award ceremonies for academic achievement at University is an exciting event under the category of Award Shows and Recognition Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to award ceremonies for academic achievement, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Award ceremonies for academic achievement at University promises to deliver value and excitement to all attendees.",
    "location": "Multipurpose Hall, University",
    "image_url": "https://picsum.photos/seed/event105/400/250"
  },
  {
    "id": 106,
    "event_title": "Workshops and training sessions at Lagos",
    "university": "Lagos State University",
    "category": "Academic",
    "date": "2025-12-12",
    "time": "11:00 AM",
    "description": "Workshops and training sessions at Lagos is an exciting event under the category of Academic Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to workshops and training sessions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Workshops and training sessions at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, Lagos",
    "image_url": "https://picsum.photos/seed/event106/400/250"
  },
  {
    "id": 107,
    "event_title": "Research presentations and exhibitions at University",
    "university": "University of Ibadan",
    "category": "Academic",
    "date": "2026-05-27",
    "time": "17:00 AM",
    "description": "Research presentations and exhibitions at University is an exciting event under the category of Academic Events. Hosted at University of Ibadan, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to research presentations and exhibitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Research presentations and exhibitions at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event107/400/250"
  },
  {
    "id": 108,
    "event_title": "Inter-university sports competitions at University",
    "university": "University of Lagos",
    "category": "Sports",
    "date": "2025-09-14",
    "time": "16:00 AM",
    "description": "Inter-university sports competitions at University is an exciting event under the category of Sports Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at University promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, University",
    "image_url": "https://picsum.photos/seed/event108/400/250"
  },
  {
    "id": 109,
    "event_title": "Farewell parties for graduating students at Lagos",
    "university": "Lagos State University",
    "category": "Social",
    "date": "2025-12-23",
    "time": "10:00 AM",
    "description": "Farewell parties for graduating students at Lagos is an exciting event under the category of Social Events. Hosted at Lagos State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to farewell parties for graduating students, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Farewell parties for graduating students at Lagos promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, Lagos",
    "image_url": "https://picsum.photos/seed/event109/400/250"
  },
  {
    "id": 110,
    "event_title": "Campus dining events and promotions at Kwara",
    "university": "Kwara State University",
    "category": "Food-Related ",
    "date": "2026-01-28",
    "time": "10:00 AM",
    "description": "Campus dining events and promotions at Kwara is an exciting event under the category of Food-Related Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to campus dining events and promotions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Campus dining events and promotions at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Campus Pavilion, Kwara",
    "image_url": "https://picsum.photos/seed/event110/400/250"
  },
  {
    "id": 111,
    "event_title": "Campus dining events and promotions at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2025-09-07",
    "time": "16:00 AM",
    "description": "Campus dining events and promotions at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to campus dining events and promotions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Campus dining events and promotions at University promises to deliver value and excitement to all attendees.",
    "location": "Lecture Theatre, University",
    "image_url": "https://picsum.photos/seed/event111/400/250"
  },
  {
    "id": 112,
    "event_title": "Sports days and fun runs at Kwara",
    "university": "Kwara State University",
    "category": "Sports",
    "date": "2025-10-08",
    "time": "16:00 AM",
    "description": "Sports days and fun runs at Kwara is an exciting event under the category of Sports Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to sports days and fun runs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Sports days and fun runs at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, Kwara",
    "image_url": "https://picsum.photos/seed/event112/400/250"
  },
  {
    "id": 113,
    "event_title": "Charity events and fundraisers at University",
    "university": "University of Lagos",
    "category": "Social",
    "date": "2026-07-14",
    "time": "10:00 AM",
    "description": "Charity events and fundraisers at University is an exciting event under the category of Social Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to charity events and fundraisers, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Charity events and fundraisers at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event113/400/250"
  },
  {
    "id": 114,
    "event_title": "Inter-university sports competitions at Kwara",
    "university": "Kwara State University",
    "category": "Sports",
    "date": "2026-06-22",
    "time": "16:00 AM",
    "description": "Inter-university sports competitions at Kwara is an exciting event under the category of Sports Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to inter-university sports competitions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Inter-university sports competitions at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, Kwara",
    "image_url": "https://picsum.photos/seed/event114/400/250"
  },
  {
    "id": 115,
    "event_title": "Cultural festivals and fairs at University",
    "university": "University of Ilorin",
    "category": "Cultural",
    "date": "2026-04-10",
    "time": "16:00 AM",
    "description": "Cultural festivals and fairs at University is an exciting event under the category of Cultural Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to cultural festivals and fairs, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Cultural festivals and fairs at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event115/400/250"
  },
  {
    "id": 116,
    "event_title": "Honorary lectures and keynote speeches at Kwara",
    "university": "Kwara State University",
    "category": "Club & Organization",
    "date": "2026-05-27",
    "time": "13:00 AM",
    "description": "Honorary lectures and keynote speeches at Kwara is an exciting event under the category of Award Shows and Recognition Events. Hosted at Kwara State University, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to honorary lectures and keynote speeches, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Honorary lectures and keynote speeches at Kwara promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, Kwara",
    "image_url": "https://picsum.photos/seed/event116/400/250"
  },
  {
    "id": 117,
    "event_title": "Workshops and training sessions at University",
    "university": "University of Lagos",
    "category": "Academic",
    "date": "2025-08-26",
    "time": "15:00 AM",
    "description": "Workshops and training sessions at University is an exciting event under the category of Academic Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to workshops and training sessions, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Workshops and training sessions at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event117/400/250"
  },
  {
    "id": 118,
    "event_title": "Food-themed competitions (e.g., cooking, baking) at University",
    "university": "University of Ilorin",
    "category": "Food-Related ",
    "date": "2025-12-27",
    "time": "12:00 AM",
    "description": "Food-themed competitions (e.g., cooking, baking) at University is an exciting event under the category of Food-Related Events. Hosted at University of Ilorin, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to food-themed competitions (e.g., cooking, baking), meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Food-themed competitions (e.g., cooking, baking) at University promises to deliver value and excitement to all attendees.",
    "location": "Open Grounds, University",
    "image_url": "https://picsum.photos/seed/event118/400/250"
  },
  {
    "id": 119,
    "event_title": "Welcome parties for new students at University",
    "university": "University of Lagos",
    "category": "Social",
    "date": "2025-10-11",
    "time": "11:00 AM",
    "description": "Welcome parties for new students at University is an exciting event under the category of Social Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to welcome parties for new students, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Welcome parties for new students at University promises to deliver value and excitement to all attendees.",
    "location": "Main Auditorium, University",
    "image_url": "https://picsum.photos/seed/event119/400/250"
  },
  {
    "id": 120,
    "event_title": "Guest lectures and TED-style talks at University",
    "university": "University of Lagos",
    "category": "Academic",
    "date": "2025-09-13",
    "time": "17:00 AM",
    "description": "Guest lectures and TED-style talks at University is an exciting event under the category of Academic Events. Hosted at University of Lagos, this event aims to bring students together for a meaningful experience. Participants will have the opportunity to engage in a wide range of activities related to guest lectures and ted-style talks, meet like-minded peers, and enjoy a vibrant campus atmosphere. Whether you're there to learn, network, or simply have fun, Guest lectures and TED-style talks at University promises to deliver value and excitement to all attendees.",
    "location": "Student Centre, University",
    "image_url": "https://picsum.photos/seed/event120/400/250"
  }
]
